Revit 2026 API

# StructuralWallUsage Enumeration

---

Represents the structural usage of a wall.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructuralWallUsage
```
```vb
Public Enumeration StructuralWallUsage
```
```cpp
public enum class StructuralWallUsage
```
```fsharp
type StructuralWallUsage
```

| Member name | Value | Description |
| --- | --- | --- |
| Bearing | 1 | Structural usage is bearing. |
| Combined | 3 | Structural usage is combined. |
| NonBearing | 0 | Structural usage is non-bearing. |
| Shear | 2 | Structural usage is shear. |

#### Reference

Autodesk.Revit.DB.Structure Namespace